// @strict-types

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.СтатусСтанций.Записывать = Истина;
	Движение = Движения.СтатусСтанций.Добавить();
	Движение.Период = Дата;
	Движение.Станция = Станция;
	Движение.Состояние = ПричинаОстановки;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостояниеНоменклатурыСрезПоследних.Товар
	|ИЗ
	|	РегистрСведений.СостояниеНоменклатуры.СрезПоследних(&Период,) КАК СостояниеНоменклатурыСрезПоследних
	|ГДЕ
	|	СостояниеНоменклатурыСрезПоследних.Станция = &Станция";

	Запрос.УстановитьПараметр("Станция", Станция);
	Запрос.УстановитьПараметр("Период", Дата);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Попытка
		НачатьТранзакцию();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Документ = Документы.ВыводИзЭксплуатации.СоздатьДокумент();
			Товар = ВыборкаДетальныеЗаписи.Товар; // СправочникСсылка.Номенклатура -
			Документ.Товар = Товар;
			Документ.Основание = Перечисления.ОснованияВыводаТовараИзЭксплуатации.ПрофилактическиеРаботы;
			Документ.Дата = Дата;
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры