// @strict-types

// Параметры:
// Отказ - Булево
// НуженРежимРабочегоОкна - Булево
Процедура НастройкаИнтерфейса(Отказ, НуженРежимРабочегоОкна) Экспорт
	НачальнаяСтраница = Новый НастройкиНачальнойСтраницы;
	СоставФорм = НачальнаяСтраница.ПолучитьСоставФорм();
	СоставФорм.ЛеваяКолонка.Очистить();
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Имя = "Регистрация" Тогда
		СоставФорм.ЛеваяКолонка.Добавить(Метаданные.ОбщиеФормы.Регистрация.ПолноеИмя());
		НуженРежимРабочегоОкна = Истина;
	Иначе
		Клиент = ПользователиВызовСервера.ТекущийКлиент();
		Если ЗначениеЗаполнено(Клиент) Тогда
			НуженРежимРабочегоОкна = Истина;
			Если Клиент.Статус = Справочники.Статусы.Новый Тогда
				СоставФорм.ЛеваяКолонка.Добавить(Метаданные.ОбщиеФормы.ФормаЛКСтандарт.ПолноеИмя());
			Иначе
				СоставФорм.ЛеваяКолонка.Добавить(Метаданные.ОбщиеФормы.ФормаЛКПремиум.ПолноеИмя());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", НачальнаяСтраница);
КонецПроцедуры