//@strict-types

&НаКлиенте
Процедура ПересчитатьСумму()
	Объект.СуммаОплаты = Окр(Объект.Тариф * Объект.ВремяАренды * (100 - Объект.Скидка) / 100, 0,
		РежимОкругления.Окр15как10);
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПересчитатьСумму();
КонецПроцедуры
&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ПользовательПриИзмененииНаСервере();
	ПересчитатьСумму();
КонецПроцедуры

&НаСервере
Процедура ПользовательПриИзмененииНаСервере()
	Объект.Скидка = Объект.Клиент.Статус.Скидка;
КонецПроцедуры

&НаКлиенте
Процедура ТарифПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ТоварПриИзменении(Элемент)
	ТоварПриИзмененииНаСервере();
	ПересчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура ВремяАрендыПриИзменении(Элемент)
	ПересчитатьСумму();
КонецПроцедуры

&НаСервере
Процедура ТоварПриИзмененииНаСервере()
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрайсПоТарифам.Тариф
		|ИЗ
		|	РегистрСведений.ПрайсПоТарифам КАК ПрайсПоТарифам
		|ГДЕ
		|	ПрайсПоТарифам.ТипНоменклатуры = &ТипНоменклатуры";
	
	Запрос.УстановитьПараметр("ТипНоменклатуры", Объект.Товар.ТипНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Значение = ВыборкаДетальныеЗаписи.Тариф; // Число -
		Объект.Тариф = Значение;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецПроцедуры