// @strict-types
#Если Не ВебКлиент Тогда
&НаКлиенте
Процедура Сохранить(Команда)
	Записать();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИзменитьПароль(Команда)
	Текст = Ждать ВвестиСтрокуАсинх(Объект.Пароль,"Введите новый пароль",,Ложь);
	Если ЗначениеЗаполнено(Текст) Тогда
		Объект.Пароль = Текст;
	КонецЕсли;
	Записать();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИзменитьДанные(Команда)
	Элементы.Группа3.ПодчиненныеЭлементы.Группа1.ПодчиненныеЭлементы.НомерТелефона.ТолькоПросмотр = Ложь;
	Элементы.ЭлектроннаяПочта.ТолькоПросмотр = Ложь;
	Элементы.Наименование.ТолькоПросмотр = Ложь;
	Элементы.Сохранить.Видимость = Истина;
КонецПроцедуры



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АрендуетВДанныйМомент.Параметры.УстановитьЗначениеПараметра("Арендатор", Объект.Ссылка);
КонецПроцедуры

#КонецЕсли