//@strict-types
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ТоварОбъект = Товар.ПолучитьОбъект();
	Если ТоварОбъект = Неопределено Или ТоварОбъект.Заблокирован() Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Данный товар заблокирован или уже удален.", "Товар", ЭтотОбъект);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ТоварОбъект.Используется = Ложь;
	Если Основание = Перечисления.ОснованияВыводаТовараИзЭксплуатации.Списание Тогда
		ТоварОбъект.ДатаВыводаИзЭксплуатации = ТекущаяДатаСеанса();
	КонецЕсли;
	ТоварОбъект.Станция = Справочники.Станции.ПустаяСсылка();
	
	ТоварОбъект.Записать();
КонецПроцедуры
