//@strict-types
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СостояниеНоменклатуры
	Движения.СостояниеНоменклатуры.Записывать = Истина;
	Движение = Движения.СостояниеНоменклатуры.Добавить();
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Арендатор = Справочники.Клиенты.ПустаяСсылка();
	Движение.Станция = Справочники.Станции.ПустаяСсылка();
	Движение.СостояниеЭксплуатации = Основание;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
