Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Срез = РегистрыСведений.СостояниеНоменклатуры.СрезПоследних(Дата,
		Новый Структура(Метаданные.РегистрыСведений.СостояниеНоменклатуры.Измерения.Товар.Имя, Товар));
	Движения.СостояниеНоменклатуры.Записывать = Истина;
	Движение = Движения.СостояниеНоменклатуры.Добавить();
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Станция = Станция;
	Если Срез.Количество() > 0 Тогда
		Движение.Арендатор = Срез[0].Арендатор;
		Движение.СостояниеЭксплуатации = Срез[0].СостояниеЭксплуатации;
	КонецЕсли;
КонецПроцедуры