Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Срез = РегистрыСведений.СостояниеНоменклатуры.СрезПоследних(Дата,
		Новый Структура(Метаданные.РегистрыСведений.СостояниеНоменклатуры.Измерения.Товар.Имя, Товар));

	Движение = Движения.СостояниеНоменклатуры.Добавить();
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Станция = Станция;

	Если Срез.Количество() > 0 Тогда
		Если Срез[0].Станция = Станция Тогда
			СообщенияКлиентСервер.СообщитьСоСвойствами(
				"Невозможно выполнить перемещение на ту же станцию, где товар находится на станцию.", "Станция",
				ЭтотОбъект);
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Движение.Арендатор = Срез[0].Арендатор;
		Движение.СостояниеЭксплуатации = Срез[0].СостояниеЭксплуатации;
	КонецЕсли;

	Движения.СостояниеНоменклатуры.Записать();
КонецПроцедуры