// @strict-types

// Проверяет ссылку на объект справочника на то, что данные реквизиты уникальны среди всех записей.
// 
// Параметры:
//   СтрРеквизитов - Структура - Структура, ключи которой являются именами реквизитами, а значения - проверяемыми значениями.
//   ЗначениеСсылка - СправочникСсылка - Проверяемая ссылка.
//   
// Возвращаемое значение:
//   Булево - Истина, если проверка пройдена.
//
Функция ПрошелКонтрольУникальностиСправочникаПоРеквизиту(СтрРеквизитов, ЗначениеСсылка) Экспорт
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				   |    Спр.Ссылка
				   |ИЗ
				   |    Справочник." + ЗначениеСсылка.Метаданные().Имя + " КАК Спр
																		 |ГДЕ
																		 |    Спр.Ссылка <> &ПарЗначениеСсылка
																		 |";

	Нум = 0;

	Для Каждого Знч Из СтрРеквизитов Цикл
		ИмяПараметраВЗапросе = " = &Пар" + Строка(Нум);
		Запрос.Текст = Запрос.Текст + " И Спр." + Знч.Ключ + ИмяПараметраВЗапросе;
		Запрос.УстановитьПараметр("Пар" + Строка(Нум), Знч.Значение);
		Нум = Нум + 1;
	КонецЦикла;

	Запрос.УстановитьПараметр("ПарЗначениеСсылка", ЗначениеСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Пустой();
КонецФункции