Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр УчастиеВИвентах
	Движения.УчастиеВИвентах.Записывать = Истина;
	Движение = Движения.УчастиеВИвентах.Добавить();
	Движение.Ивент = Ивент;
	Движение.Клиент = Клиент;

	// регистр СтатистикаПользователей
	Движения.СтатистикаПользователей.Записывать = Истина;
	Движение = Движения.СтатистикаПользователей.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Клиент = Клиент;
	Движение.ЧислоМероприятий = 1;
	Движение.Баланс = Ивент.Баллы;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем, что дата участия в периоде ивента.
	Если (Дата > Ивент.ДатаЗакрытия Или Дата < Ивент.ДатаОткрытия) Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Участие в ивенте не может произойти вне дат его проведения.",
			"Дата", ЭтотОбъект);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры