// @strict-types

// Параметры:
// 	 Строка - Строка
// Возвращаемое значение:
//   Число, Неопределено - результат.
Функция СтрокаВЧисло(Знач Строка) Экспорт
	Попытка
		Возврат Число(Строка);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

// Параметры:
// 	 ДатаСтрока - Строка
// Возвращаемое значение:
//   Дата, Неопределено - результат.
Функция СтрокаВДату(Знач ДатаСтрока) Экспорт

	ПозицияПробела = СтрНайти(ДатаСтрока, " ", НаправлениеПоиска.СНачала);
	Если ПозицияПробела > 0 Тогда
		ДатаСтрока = Лев(ДатаСтрока, ПозицияПробела - 1);
	КонецЕсли;
	ДатаСтрока = СокрЛП(СтрЗаменить(ДатаСтрока, ".", ""));
	ДатаСтрока = Сред(ДатаСтрока, 5) + Сред(ДатаСтрока, 3, 2) + Лев(ДатаСтрока, 2);
	Если СтрДлина(ДатаСтрока) = 6 Тогда
		ДатаСтрока = "20" + ДатаСтрока;
	КонецЕсли;

	Попытка
		Возврат Дата(ДатаСтрока);

	Исключение
		Возврат Неопределено;
	КонецПопытки;
КонецФункции
