// @strict-types


// Находит ссылку на перечисление по данному синониму. Если не найдено, возвращает пустую ссылку.
// Параметры:
// 	 Строка - Строка - Синоним
// 	 Менеджер - ПеречислениеМенеджер
// Возвращаемое значение:
//   ПеречислениеСсылка, Неопределено - результат.
Функция ПеречислениеПоСинониму(Знач Строка, Менеджер) Экспорт
	Ссылка = Менеджер.ПустаяСсылка(); // ПеречислениеСсылка -
	мдЗначенияПеречисления = Ссылка.Метаданные().ЗначенияПеречисления;
	мдЗначение = мдЗначенияПеречисления.Найти(СтрЗаменить(Строка, " ", ""));

	Если мдЗначение <> Неопределено Тогда
		Ссылка = Менеджер[мдЗначенияПеречисления.Индекс(мдЗначение)]; // ПеречислениеСсылка -
	КонецЕсли;

	Возврат Ссылка;
КонецФункции