&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Клиент = ПользователиВызовСервера.ТекущийКлиент();
	Объект.Телефон = Объект.Клиент.НомерТелефона;
	Объект.Почта = Объект.Клиент.ЭлектроннаяПочта;
КонецПроцедуры
&НаКлиенте
Асинх Процедура ПослеЗаписи(ПараметрыЗаписи)
#Если Не ВебКлиент Тогда
	Ждать ПредупреждениеАсинх("Анкета на Премиум аккаунт проведена. При следующем входе в систему вы получите доступ к расширенному личному кабинету.");
#Иначе
#КонецЕсли
	ПрекратитьРаботуСистемы(Истина, "/N " + Объект.Наименование);
КонецПроцедуры