// @strict-types
#Если Не ВебКлиент Тогда

&НаКлиенте
Процедура ЗаполнитьАнкетуПремиумАккаута(Команда)
	ОткрытьФорму("Документ.ПодпискаНаСервис.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура НаписатьВПоддержку(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛКПоддержка");
КонецПроцедуры

&НаКлиенте
Асинх Процедура Изменить2(Команда)
	Текст = Ждать ВвестиСтрокуАсинх(Клиент.ЭлектроннаяПочта,"Введите новый E-mail",320,Ложь);
	Если ЗначениеЗаполнено(Текст) Тогда
		Клиент.ЭлектроннаяПочта = Текст;
	КонецЕсли;
	Записать();
КонецПроцедуры

&НаКлиенте
Асинх Процедура Изменить1(Команда)
	Текст = Ждать ВвестиСтрокуАсинх(Клиент.НомерТелефона,"Введите новый номер телефона",16,Ложь);
	Если ЗначениеЗаполнено(Текст) Тогда
		Клиент.НомерТелефона = Текст;
	КонецЕсли;
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРазделАренда(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛКАренда");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРазделСтанции(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛКСтанции");
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПополнитьБаланс(Команда)
	ПополнитьНаСервере(Ждать ВвестиЧислоАсинх(0,"Пополнить на:",4,0));
КонецПроцедуры

&НаСервере
Процедура ПополнитьНаСервере(Число)
	Пополнение = Документы.ПополнениеБаланса.СоздатьДокумент();
	Пополнение.Дата = ТекущаяДатаСеанса();
	Пополнение.Клиент = Клиент.Ссылка;
	Пополнение.Сумма = Число;
	Пополнение.Записать(РежимЗаписиДокумента.Проведение);
	Баланс = РегистрыНакопления.СтатистикаПользователей.Остатки(,Новый Структура("Клиент", Клиент.Ссылка)).Итог("Баланс");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначениеВДанныеФормы(ПользователиВызовСервера.ТекущийКлиент().ПолучитьОбъект(), Клиент);
	Баланс = РегистрыНакопления.СтатистикаПользователей.Остатки(,Новый Структура("Клиент", Клиент.Ссылка)).Итог("Баланс");
КонецПроцедуры

#КонецЕсли