// @strict-types

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбъектЗначение = ДанныеФормыВЗначение(КлиентОбъект, Тип("СправочникОбъект.Клиенты"));
	Сообщить(ЗначениеВСтрокуВнутр(ОбъектЗначение));
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Клиент) Тогда
		ОбъектЗначение.Записать();
		ТекущийОбъект.Клиент = ОбъектЗначение.Ссылка;
	Иначе
		ПолученныйОбъект = ТекущийОбъект.Клиент.ПолучитьОбъект();
		Если ПолученныйОбъект = Неопределено Или ПолученныйОбъект.Заблокирован() Тогда
			СообщенияКлиентСервер.СообщитьСоСвойствами("Выбранный клиент заблокирован.", "Логин",
				ЭтотОбъект);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПолученныйОбъект, ОбъектЗначение);
		ПолученныйОбъект.Записать();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.Клиент.Пустая() Тогда
			ПолученныйОбъект = Объект.Клиент.ПолучитьОбъект();
		ЗначениеВДанныеФормы(ПолученныйОбъект,КлиентОбъект);
		Если ПолученныйОбъект = Неопределено Или ПолученныйОбъект.Заблокирован() Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры
	