// @strict-types

// Возвращаемое значение:
//   СправочникСсылка.Сотрудники
Функция ТекущийСотрудник() Экспорт
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Возврат Справочники.Сотрудники.НайтиПоНаименованию(Пользователь.ПолноеИмя);
КонецФункции

// Возвращаемое значение:
//   СправочникСсылка.Клиенты
Функция ТекущийКлиент() Экспорт
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Возврат Справочники.Клиенты.НайтиПоНаименованию(Пользователь.Имя);
КонецФункции
