// @strict-types


&НаКлиенте
Процедура ПричинаПриИзменении(Элемент)
	Если Объект.Причина = ПредопределенноеЗначение("Перечисление.ПричиныПолученияБаллов.ЗаИвент") Тогда
		Элементы.Сотрудник.Видимость = Ложь;
		Элементы.Ивент.Видимость = Истина;		
	ИначеЕсли Объект.Причина = ПредопределенноеЗначение("Перечисление.ПричиныПолученияБаллов.ПоРешениюСотрудника") Тогда
		Элементы.Сотрудник.Видимость = Истина;
		Элементы.Ивент.Видимость = Ложь;		
	Иначе
		Элементы.Сотрудник.Видимость = Ложь;
		Элементы.Ивент.Видимость = Ложь;		
	КонецЕсли;
КонецПроцедуры
