// @strict-types

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Клиент = ПользователиВызовСервера.ТекущийКлиент();

КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	Если Не ЗначениеЗаполнено(Тема) Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Необходимо указать тему.", "Тема", ЭтотОбъект);
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Сообщение) Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Необходимо указать сообщение.", "Сообщение", ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	//KO.T.E@yandex.ru.

	ПосылкаПочтыВызовСервера.ПростаяОтправкаПисьма("KO.T.E@yandex.ru", "Письмо от " + Клиент.Наименование
		+ " на тему " + Строка(Тема), Строка(ТекущаяДатаСеанса()) + " Поступило письмо от пользователя"
		+ Клиент.Наименование + "
								|
								|Письмо: " + Сообщение, , );
КонецПроцедуры