&НаКлиенте
Процедура СтанцияИлиИмяПриИзменении(Элемент)
	Если ТипЗнч(СтанцияИлиНаименование) = Тип("СправочникСсылка.Станции") Тогда
		Если Не СтанцияИлиНаименование.Пустая() Тогда
			ЗаписатьСтанцияИлиИмяВОбъект();
		КонецЕсли;
	Иначе
		ЗаписатьНовыйОбъект();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСтанцияИлиИмяВОбъект()
	ПолученныйОбъект = СтанцияИлиНаименование.ПолучитьОбъект();
	Если ПолученныйОбъект = Неопределено Или ПолученныйОбъект.Заблокирован() Тогда
		СообщенияКлиентСервер.СообщитьСоСвойствами("Выбранная станция заблокирована.", "СтанцияИлиНаименование", ЭтотОбъект);
		Возврат;
	КонецЕсли;
	ЗначениеВДанныеФормы(ПолученныйОбъект, СтанцияОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНовыйОбъект()
	ПолученныйОбъект = Справочники.Станции.СоздатьЭлемент();
	ЗначениеВДанныеФормы(ПолученныйОбъект, СтанцияОбъект);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТипЗнч(СтанцияИлиНаименование) = Тип("Строка") Тогда
		СтанцияОбъект.Наименование = СтанцияИлиНаименование;
	КонецЕсли;

	ОбъектЗначение = ДанныеФормыВЗначение(СтанцияОбъект, Тип("СправочникОбъект.Станции")); // СправочникОбъект.Станции -
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Станция) Тогда
		ОбъектЗначение.Записать();
		ТекущийОбъект.Станция = ОбъектЗначение.Ссылка;
	Иначе
		ПолученныйОбъект = ТекущийОбъект.Станция.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(ПолученныйОбъект) Или ПолученныйОбъект.Заблокирован() Тогда
			СообщенияКлиентСервер.СообщитьСоСвойствами("Выбранная станция заблокирована.", "СтанцияИлиНаименование", ЭтотОбъект);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ПолученныйОбъект, ОбъектЗначение);
		ПолученныйОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Станция) Тогда
		СтанцияИлиНаименование = Объект.Станция;
	КонецЕсли;
КонецПроцедуры