
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтанция = Станция.ПолучитьОбъект();
	ТекСтанция.Статус = Основание;
	ТекСтанция.Записать();
	
	Для Каждого Позиция Из ТоварыДляПеремещения Цикл
		Перемещение = Документы.ПеремещениеТовара.СоздатьДокумент();
		Перемещение.Дата = Дата;
		Перемещение.Станция = Позиция.СтанцияПеремещения;
		Перемещение.Товар = Позиция.ТоварНаСтанции;
		Перемещение.Инициатор = ПользователиВызовСервера.ТекущийСотрудник();
		Перемещение.Записать();
	КонецЦикла;
КонецПроцедуры
