Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СтатусСтанций
	Движения.СтатусСтанций.Записывать = Истина;
	Движение = Движения.СтатусСтанций.Добавить();
	Движение.Период = Дата;
	Движение.Станция = Станция;
	Движение.Состояние = Основание;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

	Для Каждого Позиция Из ТоварыДляПеремещения Цикл
		Перемещение = Документы.ПеремещениеТовара.СоздатьДокумент();
		Перемещение.Дата = Дата;
		Перемещение.Станция = Позиция.СтанцияПеремещения;
		Перемещение.Товар = Позиция.ТоварНаСтанции;
		Перемещение.Инициатор = ПользователиВызовСервера.ТекущийСотрудник();
		Перемещение.Записать();
	КонецЦикла;
КонецПроцедуры
