// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = ПолучитьОбщийМакет(Метаданные.ОбщиеМакеты.ОтчетОРаботеСистемы);
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КОЛИЧЕСТВО(СостояниеНоменклатурыСрезПоследних.Товар) КАК КоличествоТоваров,
		|	КОЛИЧЕСТВО(СтатусСтанцийСрезПоследних.Станция) КАК ИзНихРаботают
		|ПОМЕСТИТЬ КолвоТоваров
		|ИЗ
		|	РегистрСведений.СостояниеНоменклатуры.СрезПоследних(&Период,) КАК СостояниеНоменклатурыСрезПоследних,
		|	РегистрСведений.СтатусСтанций.СрезПоследних КАК СтатусСтанцийСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРаботеСистемы КАК ОтчетОРаботеСистемы
		|		ПО ИСТИНА
		|ГДЕ
		|	ОтчетОРаботеСистемы.Ссылка В (&Ссылка)
		|	И СтатусСтанцийСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.СтатусыСтанций.Ок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	КОЛИЧЕСТВО(СостояниеНоменклатурыСрезПоследних.Товар) КАК ИзНихВЭксплуатации,
		|	Среднее(КолвоТоваров.КоличествоТоваров) КАК КоличествоТоваров,
		|	КОЛИЧЕСТВО(ТипыНоменклатуры.Ссылка) КАК КоличествоТиповНоменклатуры,
		|	КОЛИЧЕСТВО(СтатусСтанцийСрезПоследних.Станция) КАК КоличествоСтанцийВсего
		|ИЗ
		|	РегистрСведений.СостояниеНоменклатуры.СрезПоследних(&Период,) КАК СостояниеНоменклатурыСрезПоследних,
		|	Документ.ОтчетОРаботеСистемы КАК ОтчетОРаботеСистемы,
		|	КолвоТоваров КАК КолвоТоваров,
		|	Справочник.ТипыНоменклатуры КАК ТипыНоменклатуры,
		|	РегистрСведений.СтатусСтанций.СрезПоследних КАК СтатусСтанцийСрезПоследних
		|ГДЕ
		|	ОтчетОРаботеСистемы.Ссылка В (&Ссылка)
		|	И
		|		СостояниеНоменклатурыСрезПоследних.СостояниеЭксплуатации = ЗНАЧЕНИЕ(Перечисление.ОснованияВыводаТовараИзЭксплуатации.ПустаяСсылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("Период", ТекущаяДатаСеанса());
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьОсновная = Макет.ПолучитьОбласть("Основная");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбластьОсновная.Параметры.Заполнить(Выборка);
		ОбластьОсновная.Параметры["Заголовок"] = "Отчет о работе системы аренды на " + Формат(ТекущаяДатаСеанса(), "ДФ='d MMMM yyyy ''года'''");
		ТабДок.Вывести(ОбластьОсновная, Выборка.Уровень());
		
		ВставлятьРазделительСтраниц = Истина;
		Прервать;
	КонецЦикла;
	//}}
КонецПроцедуры
