&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	ТипНоменклатурыПриИзмененииНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура ТипНоменклатурыПриИзмененииНаСервере()
	Срез = РегистрыСведений.ПрайсПоТарифам.СрезПоследних(Объект.Дата, Новый Структура("ТипНоменклатуры", Объект.ТипНоменклатуры));
	Если ЗначениеЗаполнено(Срез) Тогда
		СтарыйТариф = Срез.Найти(Объект.ТипНоменклатуры).Тариф; // Число -
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	Срез = РегистрыСведений.ПрайсПоТарифам.СрезПоследних(Объект.Дата, Новый Структура("ТипНоменклатуры", Объект.ТипНоменклатуры));
	Если ЗначениеЗаполнено(Срез) Тогда
		СтарыйТариф = Срез.Найти(Объект.ТипНоменклатуры).Тариф;
	КонецЕсли;
КонецПроцедуры