&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)
	ТипНоменклатурыПриИзмененииНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура ТипНоменклатурыПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		НовыйТекущийТариф = РегистрыСведений.ПрайсПоТарифам.СрезПоследних(Объект.Дата).Найти(
			Объект.ТипНоменклатуры).Тариф; // Число -
	Иначе
		НовыйТекущийТариф = РегистрыСведений.ПрайсПоТарифам.СрезПоследних().Найти(Объект.ТипНоменклатуры).Тариф; // Число -
	КонецЕсли;
	СтарыйТариф = НовыйТекущийТариф;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	НовыйТекущийТариф = РегистрыСведений.ПрайсПоТарифам.СрезПоследних(Объект.Дата).Найти(Объект.ТипНоменклатуры).Тариф; // Число -
	Элементы.СтарыйТариф.Заголовок = "Тариф на " + Формат(Объект.Дата, "ДЛФ=Д");
	СтарыйТариф = НовыйТекущийТариф;
КонецПроцедуры