
&НаКлиенте
Процедура ОткрытьРазделАренда(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛКАренда");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРазделИстория(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛКИстория");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРазделСтанции(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛКСтанции");
КонецПроцедуры

&НаКлиенте
Процедура НапистаьВПоддержку(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛКПоддержка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРазделИвенты(Команда)
	ОткрытьФорму("ОбщаяФорма.ЛКИвенты");
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьДанные(Команда)
	Элементы.КлиентНомерТелефона.ТолькоПросмотр = Ложь;
	Элементы.КлиентДопТелефон.ТолькоПросмотр = Ложь;
	Элементы.КлиентЭлектроннаяПочта.ТолькоПросмотр = Ложь;
	Элементы.КлиентДопПочта.ТолькоПросмотр = Ложь;
	Элементы.КлиентАдрес.ТолькоПросмотр = Ложь;
	Элементы.Сохранить.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	Записать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗначениеВДанныеФормы(ПользователиВызовСервера.ТекущийКлиент().ПолучитьОбъект(), Клиент);
КонецПроцедуры
