//@strict-types

&НаКлиенте
Процедура УведомитьОПоломке(Команда)
	ПоказатьПредупреждение( , "Уведомление создано.");
	УведомитьОПоломкеНаСервере();
КонецПроцедуры

&НаСервере
Процедура УведомитьОПоломкеНаСервере()
	Документ = Документы.ПриостановкаРаботыСтанции.СоздатьДокумент();
	Документ.Дата = ТекущаяДатаСеанса();
	Документ.Станция = Объект.Ссылка;
	Документ.ПричинаОстановки = Перечисления.СтатусыСтанций.Проверка;
	Документ.Записать();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.ЭлектроннаяПочта,
	|	Сотрудники.Наименование
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Должность = ЗНАЧЕНИЕ(Справочник.Должности.МастерСтанции)";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Наименование = ВыборкаДетальныеЗаписи["Наименование"]; // Строка -
		ЭлектроннаяПочта = ВыборкаДетальныеЗаписи["ЭлектроннаяПочта"]; // Строка -
		ПосылкаПочтыВызовСервера.ПростаяОтправкаПисьма(ЭлектроннаяПочта, "Уведомление о поломке", "Добрый день, "
			+ Наименование + "!
							 |
							 |Сегодня, +" + Формат(ТекущаяДатаСеанса(), "ДФ='d MMMM yyyy ''года'''") + ",
																									   |поступило уведомление о поломке станции "
			+ Объект.Наименование + ", номер " + Объект.Код + ".", , );
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	ПосылкаПочтыВызовСервера.ПростаяОтправкаПисьма( , , , , );
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДоступнаяНоменклатура.Параметры.УстановитьЗначениеПараметра("Станция", Объект.Ссылка);
КонецПроцедуры