// @strict-types

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Отчество) И ЗначениеЗаполнено(Фамилия) И ЗначениеЗаполнено(Имя) Тогда
		Наименование = Фамилия + " " + Имя + " " + Отчество;
	ИначеЕсли ЗначениеЗаполнено(Фамилия) И ЗначениеЗаполнено(Имя) Тогда
		Наименование = Фамилия + " " + Имя;
	ИначеЕсли ЗначениеЗаполнено(Фамилия) Тогда
		Наименование = Фамилия;
	ИначеЕсли ЗначениеЗаполнено(Имя) Тогда
		Наименование = Имя;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИнформационнойБазы);

	Если Пользователь = Неопределено Тогда
		Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	КонецЕсли;

	Пользователь.Имя = Наименование;
	Пользователь.Записать();
	Пользователь.Роли.Добавить(Метаданные.Роли.Найти(Должность.Наименование));
	ИдентификаторПользователяИнформационнойБазы = Пользователь.УникальныйИдентификатор;
КонецПроцедуры