//@strict-types

// Создает и сообщает сообщение с нужными свойствами.
// Параметры:
//   Текст - Строка - Текст сообщения.
//   Поле - Строка, Неопределено - Поле, на котором вывести сообщение.
//   Данные - Произвольный - Данные
Процедура СообщитьСоСвойствами(Текст, Поле, Данные) Экспорт
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Если Поле <> Неопределено Тогда
		Сообщение.Поле = Поле;
	КонецЕсли;
	Сообщение.УстановитьДанные(Данные);
	Сообщение.Сообщить();
КонецПроцедуры