//@strict-types

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Срез = РегистрыСведений.СостояниеНоменклатуры.СрезПоследних(Дата,
		Новый Структура(Метаданные.РегистрыСведений.СостояниеНоменклатуры.Измерения.Товар.Имя, Товар));

	Если Срез.Количество() > 0 Тогда
		Если Срез[0][Метаданные.РегистрыСведений.СостояниеНоменклатуры.Ресурсы.Арендатор.Имя] <> Клиент Тогда
			СообщенияКлиентСервер.СообщитьСоСвойствами("Товар не арендован указанным клиентом.", "Товар", ЭтотОбъект);
			Отказ = Истина;
		КонецЕсли;

		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СостояниеНоменклатуры
	Движения.СостояниеНоменклатуры.Записывать = Истина;
	Движение = Движения.СостояниеНоменклатуры.Добавить();
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Арендатор = Справочники.Клиенты.ПустаяСсылка();
	Движение.Станция = Станция;
	Движение.СостояниеЭксплуатации = Перечисления.ОснованияВыводаТовараИзЭксплуатации.ПустаяСсылка();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
