//@strict-types

// Вычисляет число цифр в исходной строке.
// 
// Параметры:
//   Строка - Строка - Исходная строка.
// Возвращаемое значение:
//   Число - Число вхождений.  
Функция СтрЧислоЦифр(Строка) Экспорт
	Если СтрДлина(Строка) = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат СтрЧислоВхождений(Строка, "0") + СтрЧислоВхождений(Строка, "1") + СтрЧислоВхождений(Строка, "2")
		+ СтрЧислоВхождений(Строка, "3") + СтрЧислоВхождений(Строка, "4") + СтрЧислоВхождений(Строка, "5")
		+ СтрЧислоВхождений(Строка, "6") + СтрЧислоВхождений(Строка, "7") + СтрЧислоВхождений(Строка, "8")
		+ СтрЧислоВхождений(Строка, "9");
КонецФункции