// Процедура заполняет табличный документ для печати.
//
// Параметры:
//      ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//      Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура Печать(ТабДок, Ссылка) Экспорт
        //{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
        Макет = ПолучитьОбщийМакет("ЧекПоОперации");
        Запрос = Новый Запрос;
        Запрос.Текст =
                "ВЫБРАТЬ
                |	""№ "" + СТРОКА(ОплатаАренды.Номер) КАК Номер,
                |	ПОДСТРОКА(СТРОКА(ОплатаАренды.Дата), 1, 10) КАК Дата,
                |	СТРОКА(ОплатаАренды.Скидка) + ""%"" КАК Скидка,
                |	ОплатаАренды.ВремяАренды КАК ВремяАренды,
                |	ОплатаАренды.СуммаОплаты КАК СуммаОплаты,
                |	ОплатаАренды.Тариф * ОплатаАренды.ВремяАренды КАК СуммаБезСкидки,
                |	ОплатаАренды.Клиент.ЭлектроннаяПочта КАК ЭлектроннаяПочта,
                |	ОплатаАренды.Клиент.ФИО КАК Имя,
                |	""Чек по операции аренда товара "" + ОплатаАренды.Товар.Наименование + "", артикул "" + ОплатаАренды.Товар.Код КАК
                |		Заголовок
                |ИЗ
                |	Документ.ОплатаАренды КАК ОплатаАренды
                |ГДЕ
                |	ОплатаАренды.Ссылка В (&Ссылка)";
        Запрос.Параметры.Вставить("Ссылка", Ссылка);
        Выборка = Запрос.Выполнить().Выбрать();

        Основная = Макет.ПолучитьОбласть("Основная");

        ТабДок.Очистить();

        ВставлятьРазделительСтраниц = Ложь;
        Пока Выборка.Следующий() Цикл
                Если ВставлятьРазделительСтраниц Тогда
                        ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
                КонецЕсли;

                Основная.Параметры.Заполнить(Выборка);
                Основная.Параметры.ПочтаОтправления = ПосылкаПочтыВызовСервера.ОсновнойАдресПочты();
                ТабДок.Вывести(Основная);
                ВставлятьРазделительСтраниц = Истина;
        КонецЦикла;
        //}}
КонецПроцедуры