//@strict-types

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Скидка) Тогда
		Скидка = Клиент.Статус.Скидка;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Тариф) Тогда
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрайсПоТарифамСрезПоследних.Тариф
		|ИЗ
		|	РегистрСведений.ПрайсПоТарифам.СрезПоследних(&Период,) КАК ПрайсПоТарифамСрезПоследних
		|ГДЕ
		|	ПрайсПоТарифамСрезПоследних.ТипНоменклатуры = &ТипНоменклатуры";

		Запрос.УстановитьПараметр("ТипНоменклатуры", Товар.ТипНоменклатуры);
		Запрос.УстановитьПараметр("Период", Дата);
		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Значение = ВыборкаДетальныеЗаписи.Тариф; // Число -
			Тариф = Значение;
		КонецЕсли;
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Если Не ЗначениеЗаполнено(СуммаОплаты) Тогда
		СуммаОплаты = Окр(Тариф * ВремяАренды * (100 - Скидка) / 100, 0, РежимОкругления.Окр15как10);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.СтатистикаПользователей.Записывать = Истина;
	Движение = Движения.СтатистикаПользователей.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.ВремяАренды = ВремяАренды;
	Движение.ЧислоАренд = 1;

	Движение = Движения.СтатистикаПользователей.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Баланс = СуммаОплаты;

КонецПроцедуры