//@strict-types
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр СостояниеНоменклатуры
	Движения.СостояниеНоменклатуры.Записывать = Истина;
	Движение = Движения.СостояниеНоменклатуры.Добавить();
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Станция = Станция;

	Движение.СостояниеЭксплуатации = Перечисления.ОснованияВыводаТовараИзЭксплуатации.ПустаяСсылка();

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры